In [1]:
import pandas as pd
import numpy as np

In [2]:
hr_data = pd.read_csv("human_resources.dat")

In [3]:
hr_data

       name  gender  years_in_service  salary               position
0     Alice  female                 6   75000        Program Manager
1       Bob    male                14   45000           Help Desk
2     David    male                10   60500                  Clerk
3    Harold    male                 5   34000              Help Desk
4      Lisa  female                17   90000  Senior Data Scientist
5     Misha  female                29   95000   Chief Data Scientist
6       Tom    male                20   88000  Senior Data Scientist
7    Bernie    male                13   48000                  Clerk
8  Margaret  female                23  100000                    CEO
9     Billy    male                 8   50000                  Clerk

In [4]:
# sort by salary so easier to view
hr_data.sort_values('salary', ascending=False)

       name  gender  years_in_service  salary               position
8  Margaret  female                23  100000                    CEO
5     Misha  female                29   95000   Chief Data Scientist
4      Lisa  female                17   90000  Senior Data Scientist
6       Tom    male                20   88000  Senior Data Scientist
0     Alice  female                 6   75000        Program Manager
2     David    male                10   60500                  Clerk
9     Billy    male                 8   50000                  Clerk
7    Bernie    male                13   48000                  Clerk
1       Bob    male                14   45000           Help Desk
3    Harold    male                 5   34000              Help Desk

In [5]:
genderGroup = hr_data.groupby('gender')
list(genderGroup)

[('female',
         name  gender  years_in_service  salary               position
  0     Alice  female                 6   75000        Program Manager
  4      Lisa  female                17   90000  Senior Data Scientist
  5     Misha  female                29   95000   Chief Data Scientist
  8  Margaret  female                23  100000                    CEO),
 ('male',      name gender  years_in_service  salary               position
  1     Bob   male                14   45000           Help Desk
  2   David   male                10   60500                  Clerk
  3  Harold   male                 5   34000              Help Desk
  6     Tom   male                20   88000  Senior Data Scientist
  7  Bernie   male                13   48000                  Clerk
  9   Billy   male                 8   50000                  Clerk)]

In [6]:
# get all males that make under 50K with greater than 10 years in service
print("filtering using query:")
males_df = genderGroup.get_group('male')
males_under_50K = males_df.query('salary < 50000 & years_in_service > 10')
print(males_under_50K)

print("filtering using indices:")
males_under_50K = hr_data[(hr_data.salary < 50000) & 
                          (hr_data.gender=='male') &  
                          (hr_data.years_in_service > 10)]
print(males_under_50K)

filtering using query:
     name gender  years_in_service  salary      position
1     Bob   male                14   45000  Help Desk
7  Bernie   male                13   48000         Clerk
filtering using indices:
     name gender  years_in_service  salary      position
1     Bob   male                14   45000  Help Desk
7  Bernie   male                13   48000         Clerk

In [7]:
# which cleark makes the highest salary?
positionGroup = hr_data.groupby('position')
index_of_clerk = positionGroup.get_group('Clerk').salary.idxmax()
print("Index of clerk with highest salary: ", index_of_clerk )
print("Name of clerk: ", hr_data.loc[index_of_clerk]['name'] )
print("Salary of highes paid clerk: ", hr_data.loc[index_of_clerk]['salary'])

Index of clerk with highest salary:  2
Name of clerk:  David
Salary of highes paid clerk:  60500

In [8]:
# how many clerks are there?
groupByPosition = hr_data.groupby('position')
num_clerks = groupByPosition.get_group('Clerk').shape[0]  # shape returns a tuple (row, column)
print("Total number of clerks: ", num_clerks)

Total number of clerks:  3